OpenFOAM_linking/lib/nanoFoam/tutorial/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM Extend Project: Open Source CFD        |
|  \\    /   O peration     | Version:  1.6-ext                               |
|   \\  /    A nd           | Web:      www.extend-project.de                 |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      binary;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

application     rhoNanoFlowFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         0.03;	//0.06;

deltaT          5.0e-5;

writeControl    adjustableRunTime;

writeInterval   0.003;

purgeWrite      5;

writeFormat     ascii;

writePrecision  8;

writeCompression uncompressed;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  no;

maxCo           1.0;

maxDeltaT	2.0e-4;


// ************************************************************************* //
