OpenFOAM_linking/lib/nanoFoam/tutorial/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.0.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1.0e-4;

vertices        
(
    (-20   0    0)    //0
    ( 0  -20    0)    //1
    ( 0  -10    0)    //2
    (-10   0    0)    //3
    (-20   0   500)    //4
    ( 0  -20   500)    //5
    ( 0  -10   500)    //6
    (-10   0   500)    //7

    (20    0   0)     //8
    (10    0   0)     //9
    (20    0   500)    //10
    (10    0   500)    //11

    (0    20   0)     //12
    (0    10   0)     //13
    (0    20   500)    //14
    (0    10   500)    //15



);

blocks          
(
    hex (0 1 2 3 4 5 6 7)       (5 5 80)   simpleGrading (1 1 1)
    hex (1 8 9 2 5 10 11 6)     (5 5 80)   simpleGrading (1 1 1)
    hex (8 12 13 9 10 14 15 11) (5 5 80)   simpleGrading (1 1 1)
    hex (0 3 13 12 4 7 15 14)   (5 5 80)   simpleGrading (1 1 1)

    hex (3 2 9 13 7 6 11  15)   (5 5 80)   simpleGrading (1 1 1)

);

edges           
(
arc 0 1 (-10  -17.32  0)
arc 4 5 (-10  -17.32  500)

arc 1 8  (10  -17.32  0)
arc 5 10 (10  -17.32  500)

arc 8 12  (10  17.32  0)
arc 10 14 (10  17.32  500)

arc 0 12 (-10  17.32  0)
arc 4 14 (-10  17.32  500)

);

boundary
(
    outlet 
    {
        type patch;
        faces
        (
            (4 5 6 7)
            (5 10 11 6)
            (10 14 15 11)
            (4 7 15 14)
            (7 6 11 15)
        );
    }
    inlet
    {
        type patch;
        faces
        (
            (0 1 2 3)
            (1 8 9 2)
            (8 12 13 9)
            (0 3 13 12)
            (3 2 9 13)
        );
    }
    wall
    {
        type wall;
        faces
        (
         (1 8 10 5)
         (8 12 14 10)
         (12 0 4 14)
         (0 1 5 4)

        );
    }
);
mergePatchPairs 
(
);

// ************************************************************************* //
