OpenFOAM_linking/lib/nanoFoam/tutorial/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    outlet
    {
        type            patch;
        nFaces          125;
        startFace       29075;
    }
    inlet
    {
        type            patch;
        nFaces          125;
        startFace       29200;
    }
    wall
    {
        type            wall;
        inGroups        1(wall);
        nFaces          1600;
        startFace       29325;
    }
)

// ************************************************************************* //
