OpenFOAM_linking/lib/nanoFoam/tutorial/constant/particleProperties
FoamFile
{
	version 	2.0;
	format  	ascii;
	class   	dictionary;
	location	"constant";
	object  	particleProperties;
}

d_m              d_m [ 0 1 0 0 0 0 0 ] 4e-10;

rho_m            rho_m [1 -3 0 0 0 0 0] 4230;

deltadp          deltadp  [ 0 0 3 0 0 0 0 ] 1e-9;
