OpenFOAM_linking/lib/nanoFoam/tutorial/constant/thermophysicalProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      thermophysicalProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

thermoType
{
    type            hePsiThermo;
    mixture         pureMixture;
    transport       sutherland;		//const;
    thermo          janaf;		//hConst;
    equationOfState perfectGas;
    specie          specie;
    energy          sensibleEnthalpy;
}

mixture
{
    specie
    {
        nMoles      1;
        molWeight   28.0;
    }
//    thermodynamics
//    {
//        Cp          1076;
//        Hf          0;
//    }
    thermodynamics
    {
    	Tlow         	300.0;
    	Thigh        	5000.0;
    	Tcommon      	1000.0;
    	highCpCoeffs	( 2.92664 0.001487977 -5.684761e-07 1.009704e-10 -6.753351e-15 -922.7977 5.980528  );
    	lowCpCoeffs	( 3.298677 0.00140824 -3.963222e-06 5.641515e-09 -2.444855e-12 -1020.9 3.950372  );
    }
//    transport
//    {
//        mu          1.84e-05;
//        Pr          0.7;
//    }
    transport
    {
    	As              1.406e-06;    
	Ts              111;
    }
}
}


// ************************************************************************* //
