OpenFOAM_linking/lib/nanoFoam/tutorial/0/T
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      T;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 0 0 1 0 0 0];

internalField   uniform 310;

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform 310;
    }
    wall
    {
        type            fixedValue;
        value           uniform 900;
    }
    outlet
    {
        type            zeroGradient;
    }
}


// ************************************************************************* //
