OpenFOAM_linking/lib/nanoFoam/tutorial/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.2                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
        solver          PCG;
	//solver		smoothSolver;
        //preconditioner  DIC;
	preconditioner	FDIC;
	//smoother	GaussSeidel;
	//nSweeps		4;
        tolerance       1e-06;
        relTol          0.0;
    }

    pFinal
    {
        $p;
        relTol          0;
    }

    pcorr
    {
        $p;
	tolerance	1e-5;
        relTol          0;
    }

    "rho.*"
    {
        $p;
        tolerance       1e-06;
        relTol          0;
    }

    "(U|h|R|k|epsilon|omega)"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-06;
        relTol          0.0;
    }

    "(U|h|R|k|epsilon|omega)Final"
    {
        $U;
        relTol          0;
    }

    "C"
    {
        solver          PBiCG;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0.0;
    }

    "CFinal"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    momentumPredictor yes;
    transonic    no;
    nOuterCorrectors 1;
    nCorrectors      3;
    nNonOrthogonalCorrectors 1;
    rhoMin          rhoMin [ 1 -3 0 0 0 ] 0.3;
    rhoMax          rhoMax [ 1 -3 0 0 0 ] 2.0;
   
    //residualControl
    //{
    //    "(U|k|epsilon|C)"
    //    {
    //       relTol	0;
    //       tolerance	0.00001;
    //    }
    //}
     
    turbOnFinalIterationOnly   off; 
}

relaxationFactors
{
    fields
    {
    }
    equations
    {
        "U.*"		1;
	"C.*"		1;
    }
}

// ************************************************************************* //
