OpenFOAM_linking/lib/nanoFoam/tutorial/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.2.0                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 16; // # of CPU cores

//method          simple;
method          hierarchical;
//method          scotch;

simpleCoeffs
{
    n               ( 1 2 4 ); // needs to multiply to = # cores
    delta           0.0001;
}

hierarchicalCoeffs
{
    n               ( 2 2 4 );
    delta           0.000001;
    order           xyz;
}

manualCoeffs
{
    dataFile        "cellDecomposition";
}


// ************************************************************************* //
