OpenFOAM_linking/lib/nanoFoam/tutorial/system/sampleDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.1.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      sampleDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

setFormat raw;


interpolationScheme cellPoint;

// Fields to sample.
fields
(
    T
   
);

sets
(
    CASE1
    {
        type        uniform;
        axis        distance;


        start       (0.102 0.0 0.0129);
        end         (0.788 0.0 0.0129);
        nPoints     500;
    }

);




// *********************************************************************** //
